In [1]:
import pandas as pd

In [2]:
# criando uma serie
s = pd.Series([1, 2, 3, 4, 5])
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
s[0]

1

In [4]:
s[1]

2

In [5]:
s.dtype

dtype('int64')

In [6]:
s.values

array([1, 2, 3, 4, 5], dtype=int64)

In [8]:
s = pd.Series(data = [1,2,3,4], index = [2,3,4,5])

In [10]:
s.index

Int64Index([2, 3, 4, 5], dtype='int64')

In [12]:
s.values

array([1, 2, 3, 4], dtype=int64)

In [13]:
s[0]

KeyError: 0

In [14]:
s[2]

1

In [15]:
s = pd.Series(data = [1,2,3,4,5,6,7,8,9,10,11,12], index = ['jan','fev','mar','abril','maio','junho','julho','ago','set','out','nov', 'dez' ])

In [16]:
s

jan       1
fev       2
mar       3
abril     4
maio      5
junho     6
julho     7
ago       8
set       9
out      10
nov      11
dez      12
dtype: int64

In [17]:
s['ago']

8

In [18]:
s[0:6]

jan      1
fev      2
mar      3
abril    4
maio     5
junho    6
dtype: int64

In [19]:
# m√©dia
s.mean()

6.5

In [20]:
# Retorna o valor que indica o quanto os valores em torno da m√©dia se discipam em rela√ß√£o ao valor central
s.std()

3.605551275463989

In [21]:
s.max()

12

In [22]:
s.min()

1

In [23]:
s.describe()

count    12.000000
mean      6.500000
std       3.605551
min       1.000000
25%       3.750000
50%       6.500000
75%       9.250000
max      12.000000
dtype: float64

In [24]:
s.sum()

78

In [25]:
s[6:].mean()

9.5

In [27]:
s[0:3].sum()

6

In [28]:
s[0:3].mean()

2.0

In [31]:
df = pd.DataFrame({'Aluno': ['Marina', 'Felipe', 'Cleyton', 'Isabel'],
                 'Cr√©ditos cursados': [20,64,32,24],
                 'Rendimento Acad√™mico':[8.55, 7.88, 8.17, 9.04],
                 'M√™s de nascimento' : ['Novembro','Setembro','Janeiro','Julho'],
                 'Curso': ['Computa√ß√£o','Estat√≠stica','Computa√ß√£o','Matem√°tica']})

In [32]:
df

,Aluno,Cr√©ditos cursados,Rendimento Acad√™mico,M√™s de nascimento,Curso
0,Marina,20,8.55,Novembro,Computa√ß√£o
1,Felipe,64,7.88,Setembro,Estat√≠stica
2,Cleyton,32,8.17,Janeiro,Computa√ß√£o
3,Isabel,24,9.04,Julho,Matem√°tica

In [35]:
# Acessando linha 2, 3¬∫ linha
df.iloc[2]

Aluno                      Cleyton
Cr√©ditos cursados               32
Rendimento Acad√™mico          8.17
M√™s de nascimento          Janeiro
Curso                   Computa√ß√£o
Name: 2, dtype: object

In [37]:
type(df['Rendimento Acad√™mico'])

pandas.core.series.Series

In [38]:
df['Rendimento Acad√™mico'].mean()

8.41

In [39]:
df.describe()

       Cr√©ditos cursados  Rendimento Acad√™mico
count           4.000000              4.000000
mean           35.000000              8.410000
std            19.966639              0.501664
min            20.000000              7.880000
25%            23.000000              8.097500
50%            28.000000              8.360000
75%            40.000000              8.672500
max            64.000000              9.040000

In [40]:
df=pd.read_csv('https://raw.githubusercontent.com/fivethirtyeight/data/master/alcohol-consumption/drinks.csv')

In [41]:
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9

In [42]:
# indexa√ß√£o booleana
df[df['country']=='Brazil']

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
23,Brazil,245,145,16,7.2

In [43]:
df[df['total_litres_of_pure_alcohol'] >=12]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
3,Andorra,245,138,312,12.4
15,Belarus,142,373,42,14.4
98,Lithuania,343,244,56,12.9

In [44]:
df[df['total_litres_of_pure_alcohol'] == 0].head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
13,Bangladesh,0,0,0,0.0
46,North Korea,0,0,0,0.0
79,Iran,0,0,0,0.0
90,Kuwait,0,0,0,0.0

In [45]:
df.sort_values(by='wine_servings', ascending=False).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
61,France,127,151,370,11.8
136,Portugal,194,67,339,11.0
3,Andorra,245,138,312,12.4
166,Switzerland,185,100,280,10.2
48,Denmark,224,81,278,10.4